#### MakeInstance Method

---

|  |
| --- |
| FamilyManager Class   See Also |

Set the family parameter as an instance parameter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void MakeInstance( 	FamilyParameter familyParameter ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub MakeInstance ( _ 	familyParameter As FamilyParameter _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void MakeInstance( 	FamilyParameter^ familyParameter ) ``` |

#### Parameters

familyParameter
:   Type:  Autodesk.Revit.DB FamilyParameter

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input argument-"familyParameter"-is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when there is Type family parameter driven by this parameter. Or trying to make a parameter of image type to instance. |

# See Also

FamilyManager Class

Autodesk.Revit.DB Namespace